In [1]:
import pandas as pd

## Data Loading and Storage

In [4]:
my_data = {
    'Name': ['Ali', 'Sara', 'Taha', 'Omid'],
    'Score': [18, 20, 15, 17.5],
    'Age': [19, 22, 26, 18]
}

In [5]:
mydf = pd.DataFrame(my_data, columns = ['Name', 'Score', 'Age'])

In [6]:
mydf

   Name  Score  Age
0   Ali   18.0   19
1  Sara   20.0   22
2  Taha   15.0   26
3  Omid   17.5   18

## CSV : Comma Seperated Values

In [10]:
mydf.to_csv('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Score.csv', index=False)

اون دیتافریم رو داخل یک فایل سی اس وی ذخیره کرد

In [11]:
pd.read_csv('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Student.csv', header=None)

      0     1   2   3
0   Ali  18.0  19  15
1  Sara  20.0  22  18
2  Taha  15.0  26  63
3  Omid  17.5  18  60

  با این دستور یک فایل روخوندیم. این فایل هدر نداشت و اگر هدر مساوی نان رو نمیذاشتیم سطر اول رو به عنوان هدر در نظر میگرفت خودمون میتونیم هدر بذاریم براش که تو دستور بعد اومده

In [12]:
pd.read_csv('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Student.csv', names=['name', 'Python(of 20)', 'Java(of 30)', 'C++(of 70)'])

   name  Python(of 20)  Java(of 30)  C++(of 70)
0   Ali           18.0           19          15
1  Sara           20.0           22          18
2  Taha           15.0           26          63
3  Omid           17.5           18          60

### skip rows

In [13]:
pd.read_csv('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/age.csv')

  #  Hello shirafkan
0     name       age
1      Ali        12
2     Sara        13
3     Taha        12
4    Mahsa        20

In [14]:
pd.read_csv('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/age.csv', skiprows=[0])

    name  age
0    Ali   12
1   Sara   13
2   Taha   12
3  Mahsa   20

In [15]:
pd.read_csv('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/age.csv', header=[0,1])

  #  Hello shirafkan
      name       age
0      Ali        12
1     Sara        13
2     Taha        12
3    Mahsa        20

اون قبلی از خط اول که یکسری اطلاعات اضافه بود اسکیپ بود. این دستور اومده و دو تا سطر رو به عنوان هدر در نظر گرفته

## read csv,txt

In [16]:
import csv

In [17]:
with open ('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Score.csv') as f:
    x = list(csv.reader(f))
x

[['Name', 'Score', 'Age'],
 ['Ali', '18.0', '19'],
 ['Sara', '20.0', '22'],
 ['Taha', '15.0', '26'],
 ['Omid', '17.5', '18']]

In [18]:
x[2]

['Sara', '20.0', '22']

In [20]:
pd.read_table('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Score.csv')

  Name,Score,Age
0    Ali,18.0,19
1   Sara,20.0,22
2   Taha,15.0,26
3   Omid,17.5,18

In [21]:
pd.read_table('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Score.csv', sep=',')

   Name  Score  Age
0   Ali   18.0   19
1  Sara   20.0   22
2  Taha   15.0   26
3  Omid   17.5   18

In [23]:
pd.read_table('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/mytext.txt', sep='\s+')

      A  B  C
row1  1  2  3
row2  4  5  6

فایل تکست مون اسپیس هاش زیاد هست. سپریتور رو مشخص کردیم که اسپیس ها رو در نظر نگیره

## nrows, chunksize

In [31]:
path = 'G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Alphabet.csv'

In [32]:
pd.read_csv(path)

   col1  col2
0     A     1
1     B     2
2     C     3
3     D     4
4     E     5
5     F     6
6     G     7
7     H     8
8     I     9
9     J    10
10    K    11
11    L    12
12    M    13
13    N    14
14    O    15
15    P    16
16    Q    17
17    R    18
18    S    19
19    T    20
20    U    21
21    V    22
22    W    23
23    X    24
24    Y    25
25    Z    26

In [33]:
pd.read_csv(path, nrows=4)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4

این دستور مشخص میکنه چند تا سطر اول رو ببینیم. حالا اگه بخواهیم از آخر مشخص کنیم که فلاتن قدر سطر رو حذف کن داریم

In [34]:
pd.read_csv(path, skipfooter=17, engine='python')

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4
4    E     5
5    F     6
6    G     7
7    H     8
8    I     9

In [37]:
c = pd.read_csv(path, chunksize=8)
for i in c:
    print (i)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4
4    E     5
5    F     6
6    G     7
7    H     8
   col1  col2
8     I     9
9     J    10
10    K    11
11    L    12
12    M    13
13    N    14
14    O    15
15    P    16
   col1  col2
16    Q    17
17    R    18
18    S    19
19    T    20
20    U    21
21    V    22
22    W    23
23    X    24
   col1  col2
24    Y    25
25    Z    26

داره هشت سطر هشت سطر فایل رو میخونه و داخل فایل سی قرار میده و بعدش هم که پرینت کردیم

یک آپشن هست بدین صورت که از فایل که میخونه مثلا هشت سطر رو نشون بده ولی این هشت سطر اینجوری باشه که چهار سطر اول و چهار سطر آخر باشن

## sys.stdout

In [38]:
import sys

In [40]:
mydata = pd.read_csv('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Score.csv')

In [41]:
mydata.to_csv(sys.stdout)

,Name,Score,Age
0,Ali,18.0,19
1,Sara,20.0,22
2,Taha,15.0,26
3,Omid,17.5,18

خروجی استاندارد. خروجی هم تو مانیتور نمایش داده میشه و جایی ذخیره نشده

In [42]:
mydata.to_csv(sys.stdout, index=False, header=False, sep='|')

Ali|18.0|19
Sara|20.0|22
Taha|15.0|26
Omid|17.5|18

## Excel

In [43]:
# pip install openpyxl

In [45]:
mydf

   Name  Score  Age
0   Ali   18.0   19
1  Sara   20.0   22
2  Taha   15.0   26
3  Omid   17.5   18

In [47]:
mydf.to_excel('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Score.xlsx', index=False)

In [48]:
pd.read_excel('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/Score.xlsx')

   Name  Score  Age
0   Ali   18.0   19
1  Sara   20.0   22
2  Taha   15.0   26
3  Omid   17.5   18

## JSON: JavaScript Object Notation

In [50]:
import json

In [58]:
mystr = """
{
    "FirstName": "Taha",
    "Courses": [{"Name": "Python", "Score": 18}, {"Name": "C++", "Score": 17}]
}
"""

In [59]:
mydict = json.loads(mystr)
frame = pd.DataFrame(mydict['Courses'], columns=['Name', 'Score'])
frame

     Name  Score
0  Python     18
1     C++     17

In [60]:
frame.to_json()

'{"Name":{"0":"Python","1":"C++"},"Score":{"0":18,"1":17}}'

In [61]:
frame.to_json(orient='values')

'[["Python",18],["C++",17]]'

In [62]:
frame.to_json(orient='index')

'{"0":{"Name":"Python","Score":18},"1":{"Name":"C++","Score":17}}'

In [63]:
frame.to_json(orient='split')

'{"columns":["Name","Score"],"index":[0,1],"data":[["Python",18],["C++",17]]}'

## pd.HTML: Hypertext Markup Language

In [2]:
#pip install lxml

In [3]:
#pip install html5lib

In [4]:
mystr = """
<table>
    <thead>
        <tr>
            <th>name</th>
            <th>score</th>
        </tr>
    </thead>
    <tbody>
        <tr>
            <td>Ali</td>
            <td>12</td>
        </tr>
        <tr>
            <td>Sara</td>
            <td>18</td>
        </tr>
        </tbody
</table>
"""

In [5]:
lst = pd.read_html(mystr)

In [6]:
lst[0]

   name  score
0   Ali     12
1  Sara     18

میتونیم یک فایل HTML
هم بخونیم

## XML: Extensible Markup Language

In [7]:
from lxml import objectify

In [8]:
# 00:32:00

## PKL file

In [9]:
# 00:36:40

## Hierarchical Data Format (HDF)

In [10]:
# 00:38:40

## Interacting with Databases

In [11]:
import sqlite3

In [12]:
query = """ CREATE TABLE AgeTable (Name VARCHAR(20), age INTIGER); """

In [15]:
con = sqlite3.connect('G:SoftwareTutorial/Programming/Python/MachineLearning/Files/mydata.sqlite')
con.execute(query)
con.commit()

OperationalError: table AgeTable already exists

In [17]:
data = [('Ali', 37), ('Taha', 25), ('Sara', 40)]
q = "INSERT INTO AgeTable VALUES(?, ?)"
con.executemany(q, data)
con.commit()

In [18]:
q = 'Select * from AgeTable'
mydata = con.execute(q)
col = [x[0] for x in mydata.description]

In [19]:
pd.DataFrame(mydata.fetchall(), columns=col)

   Name  age
0   Ali   37
1  Taha   25
2  Sara   40

## requests.get

In [20]:
import requests

In [22]:
r = requests.get('https://api.github.com/repos/pandas-dev/pandas/issues')

In [25]:
if r.status_code == 200:
        print('Success!')
elif r.status_code == 404:
        print('Not Found.')

Success!

In [26]:
df = pd.DataFrame(r.json(), columns = ['number', 'title'])
df.head()

   number                                              title
0   47199              BUG: StataWriter value_label encoding
1   47198  ENH: Move SettingWithCopyWarning to error/__in...
2   47197               TYP: NDFrame.min/max mypy workaround
3   47196                  BUG: Period + np.timedelta64(nat)
4   47195  Add absolute value to head() and tail() docstr...

-------------------------------------------------------

تو این درس اول اومدیم گفتیم یک دیتافریم داریم چجوری تبدیل و ذخیره کنیم تو یک فایل سی اس وی
یا اینکه فایل سی اس وی داریم و میخواهیم اطلاعات رو بخونیم
همین حالات رو برای اکسل هم داشتیم
بعد اطلاعات فایل هایی مثل جیسون رو خوندیم و دیگر فایل ها

to_csv
read_csv

read_table

to_excel
read_excel

to_json
read_json

.
.
.

# The End!